<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of RingCentral Phone and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.tj.pkg.RingCentralPhone</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>RingCentral for Mac</string>
		<key>BUNDLE_ID</key>
		<string>com.ringcentral.ringcentralformac</string>
		<key>NAME</key>
		<string>RingCentral Phone</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.bradclare.download.ringcentral</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%pathname%/RingCentral for Mac.app</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>v
