<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.2.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of DBeaver Community.</string>
	<key>Identifier</key>
	<string>com.github.TomJanz.download.DBeaverCommunity</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>DBeaver</string>
		<key>NAME</key>
		<string>DBeaver Community</string>

<!--SELECT YOUR OS VERSION AND USE IT IN YOUR OVERRIDE
	"installer" for MAC OS X Pkg installer
	"macos" for MAC OS X .app
	"linux.gtk.x86" for LINUX 32bit
	"linux.gtk.x86_64" for LINUX 64bit
-->

		<key>os</key>
		<string>installer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
    	<dict>
        	<key>Arguments</key>
        	<dict>
          		<key>github_repo</key>
          		<string>dbeaver/dbeaver</string>
          		<key>asset_regex</key>
          		<string>(dbeaver-ce-[0-9]+.[0-9]+.[0-9]+[-_]+%os%.[^"]*)</string>
        	</dict>
        		<key>Processor</key>
        		<string>GitHubReleasesInfoProvider</string>
      	</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>